11/data/attachments/1e14be46acaee15e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9ad8fb8a-70f3-494a-a64f-14b965e2ce65</nif:username>
            <nif:friendToBeAdded>Tina_maybe_Friend_22797_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>